Revit 2027 API
PerformanceAdviser.ExecuteAllRules Method
 Executes all rules in the list on a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessage> ExecuteAllRules(
	Document document
)
Public Function ExecuteAllRules (
	document As Document
) As IList(Of FailureMessage)
public:
IList<FailureMessage^>^ ExecuteAllRules(
	Document^ document
)
member ExecuteAllRules :
        document : Document -> IList<FailureMessage>
Parameters
document Document
 Document on which the rules will be executed.
Return Value
IList<FailureMessage>
 Failure messages explaining performance problems detected in the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Disabled rules are not executed.
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace